# Override packages (installed on all platforms)
brew "11"
brew "git"
brew "just"


# Platform-specific packages
brew "archlinux-keyring"
brew "aylurs-gtk-shell"
brew "bitwarden"
brew "blueman"
brew "breeze"
brew "brightnessctl"
brew "checkupdates-with-aur"
brew "chrome"
brew "cliphist"
brew "dart-sass"
brew "dejadup"
brew "discord"
brew "dockutil"
brew "firefox"
brew "flatpak"
brew "fontdownloader"
brew "foreman"
brew "gearlever"
brew "getnf"
brew "gnome-calculator"
brew "gnome-system-monitor"
brew "gnome-text-editor"
brew "grim"
brew "grimblast"
brew "gtk-engine-murrine"
brew "gtk-layer-shell"
brew "gvfs"
brew "hypridle"
brew "hyprland"
brew "hyprlock"
brew "hyprpanel"
brew "hyprpaper"
brew "hyprpicker"
brew "hyprpolkitagent"
brew "hyprshade"
brew "hyprshot"
brew "hyprsunset"
brew "imv"
brew "kvantum"
brew "logseq"
brew "loupe"
brew "matugen"
brew "mission-center"
brew "mousepad"
brew "mpv-mpris"
brew "nautilus"
brew "nautilus-open-any-terminal"
brew "network-manager-applet"
brew "networkmanager"
brew "niri"
brew "npm"
brew "nwg-displays"
brew "nwg-dock-hyprland"
brew "nwg-look"
brew "obsproject"
brew "org"
brew "pacman-contrib"
brew "pacseek"
brew "pamixer"
brew "papirus-icon-theme"
brew "parsec"
brew "pavucontrol"
brew "pikabackup"
brew "pinta"
brew "pipewire"
brew "playerctl"
brew "polkit-gnome"
brew "postman"
brew "power-profiles-daemon"
brew "pupgui2"
brew "pywal"
brew "qt5ct"
brew "qt6ct"
brew "rofi-wayland"
brew "sddm"
brew "signal"
brew "simplescan"
brew "slack"
brew "slurp"
brew "swappy"
brew "swww"
brew "thunar"
brew "thunar-archive-plugin"
brew "thunar-volman"
brew "tumbler"
brew "upower"
brew "uwsm"
brew "vlc"
brew "wallust"
brew "waybar"
brew "waypaper"
brew "wf-recorder"
brew "whiptail"
brew "wireplumber"
brew "wl-clipboard"
brew "wlogout"
brew "wofi"
brew "xarchiver"
brew "xdg-desktop-portal-gtk"
brew "xdg-desktop-portal-hyprland"
brew "xdg-user-dirs"
brew "xdg-utils"
brew "yad"
brew "ytmdesktop"
brew "zen"
brew "zoom"
