# Override packages (critical infrastructure and platform-specific overrides)
brew "git"
brew "just"
brew "python@3.11"

tap "charmbracelet/tap"
tap "dhth/tap"
tap "jesseduffield/lazydocker"
tap "siderolabs/tap"

# Platform-specific packages
brew "act"
brew "atuin"
brew "bandwhich"
brew "bat"
brew "bc"
brew "binsider"
brew "biome"
brew "bitwarden-cli"
brew "btop"
brew "caddy"
brew "cava"
brew "chezmoi"
brew "coreutils"
brew "ctop"
brew "curl"
brew "direnv"
brew "dive"
brew "dockutil"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "figlet"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "gjs"
brew "glances"
brew "glow"
brew "gnu-units"
brew "gnupg"
brew "gobject-introspection"
brew "gtk4"
brew "gum"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "inetutils"
brew "inxi"
brew "jj"
brew "jq"
brew "jujutsu"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazysql"
brew "lego"
brew "libadwaita"
brew "libgtop"
brew "libnotify"
brew "libspng"
brew "llvm"
brew "lsd"
brew "mercurial"
brew "mpv"
brew "nano"
brew "neovim"
brew "nvtop"
brew "overmind"
brew "pixi"
brew "pkg-config"
brew "presenterm"
brew "python"
brew "qalculate-gtk"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tailscale"
brew "talosctl"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "ugrep"
brew "unzip"
brew "vale"
brew "vim"
brew "wget"
brew "xclip"
brew "xz"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zip"
brew "zoxide"
brew "zsh"
