brew "cask"
brew "dockutil"
cask "bitwarden"
cask "devtoys"
cask "discord"
cask "disk-diet"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "orbstack"
cask "parsec"
cask "postico"
cask "postman"
cask "raycast"
cask "retrobatch"
cask "sf-symbols"
cask "steam"
cask "temurin"
cask "tg-pro"
cask "visual-studio-code"
cask "ytmdesktop-youtube-music"
cask "zed"
cask "zen-browser"
