# Override packages (installed on all platforms)
brew "11"
brew "git"
brew "just"

# Additional override packages (from file)
brew "python@3.11"
brew "git"
brew "just"

tap "charmbracelet/tap"
tap "dhth/tap"
tap "jesseduffield/lazydocker"
tap "siderolabs/tap"

# Platform-specific packages
brew "act"
brew "archlinux-keyring"
brew "atuin"
brew "aylurs-gtk-shell"
brew "bandwhich"
brew "bat"
brew "bc"
brew "binsider"
brew "biome"
brew "bitwarden"
brew "bitwarden-cli"
brew "blueman"
brew "breeze"
brew "brightnessctl"
brew "btop"
brew "caddy"
brew "cava"
brew "checkupdates-with-aur"
brew "chezmoi"
brew "chrome"
brew "cliphist"
brew "coreutils"
brew "ctop"
brew "curl"
brew "dart-sass"
brew "dejadup"
brew "direnv"
brew "discord"
brew "dive"
brew "dockutil"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "figlet"
brew "findutils"
brew "firefox"
brew "fish"
brew "flatpak"
brew "fontdownloader"
brew "foreman"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gearlever"
brew "getnf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "gjs"
brew "glances"
brew "glow"
brew "gnome-calculator"
brew "gnome-system-monitor"
brew "gnome-text-editor"
brew "gnu-units"
brew "gnupg"
brew "gobject-introspection"
brew "grim"
brew "grimblast"
brew "gtk-engine-murrine"
brew "gtk-layer-shell"
brew "gtk4"
brew "gum"
brew "gvfs"
brew "htop"
brew "hyperfine"
brew "hypridle"
brew "hyprland"
brew "hyprlock"
brew "hyprpanel"
brew "hyprpaper"
brew "hyprpicker"
brew "hyprpolkitagent"
brew "hyprshade"
brew "hyprshot"
brew "hyprsunset"
brew "imagemagick"
brew "imv"
brew "inetutils"
brew "inxi"
brew "jj"
brew "jq"
brew "jujutsu"
brew "kvantum"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazysql"
brew "lego"
brew "libadwaita"
brew "libgtop"
brew "libnotify"
brew "libspng"
brew "llvm"
brew "logseq"
brew "loupe"
brew "lsd"
brew "matugen"
brew "mercurial"
brew "mission-center"
brew "mousepad"
brew "mpv"
brew "mpv-mpris"
brew "nano"
brew "nautilus"
brew "nautilus-open-any-terminal"
brew "neovim"
brew "network-manager-applet"
brew "networkmanager"
brew "niri"
brew "npm"
brew "nvtop"
brew "nwg-displays"
brew "nwg-dock-hyprland"
brew "nwg-look"
brew "obsproject"
brew "org"
brew "overmind"
brew "pacman-contrib"
brew "pacseek"
brew "pamixer"
brew "papirus-icon-theme"
brew "parsec"
brew "pavucontrol"
brew "pikabackup"
brew "pinta"
brew "pipewire"
brew "pixi"
brew "pkg-config"
brew "playerctl"
brew "polkit-gnome"
brew "postman"
brew "power-profiles-daemon"
brew "presenterm"
brew "pupgui2"
brew "python"
brew "pywal"
brew "qalculate-gtk"
brew "qt5ct"
brew "qt6ct"
brew "ripgrep"
brew "rofi-wayland"
brew "rsync"
brew "rust"
brew "sddm"
brew "shellcheck"
brew "shfmt"
brew "signal"
brew "simplescan"
brew "slack"
brew "slurp"
brew "starship"
brew "swappy"
brew "swww"
brew "tailscale"
brew "talosctl"
brew "thefuck"
brew "thunar"
brew "thunar-archive-plugin"
brew "thunar-volman"
brew "tlrc"
brew "tmux"
brew "tree"
brew "tumbler"
brew "ugrep"
brew "unzip"
brew "upower"
brew "uwsm"
brew "vale"
brew "vim"
brew "vlc"
brew "wallust"
brew "waybar"
brew "waypaper"
brew "wf-recorder"
brew "wget"
brew "whiptail"
brew "wireplumber"
brew "wl-clipboard"
brew "wlogout"
brew "wofi"
brew "xarchiver"
brew "xclip"
brew "xdg-desktop-portal-gtk"
brew "xdg-desktop-portal-hyprland"
brew "xdg-user-dirs"
brew "xdg-utils"
brew "xz"
brew "yad"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "ytmdesktop"
brew "zellij"
brew "zen"
brew "zip"
brew "zoom"
brew "zoxide"
brew "zsh"
