tap "charmbracelet/tap"
tap "dhth/tap"
tap "jesseduffield/lazydocker"
tap "siderolabs/tap"

# Homebrew packages
brew "atuin"
brew "bandwhich"
brew "bat"
brew "binsider"
brew "biome"
brew "bitwarden-cli"
brew "bluez"
brew "btop"
brew "caddy"
brew "cava"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dive"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "firefox"
brew "fish"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glances"
brew "glow"
brew "gnu-units"
brew "gnupg"
brew "gobject-introspection"
brew "htop"
brew "hyperfine"
brew "inetutils"
brew "inxi"
brew "jq"
brew "jujutsu"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazysql"
brew "lego"
brew "libnotify"
brew "llvm"
brew "mercurial"
brew "mpv"
brew "neovim"
brew "overmind"
brew "pixi"
brew "presenterm"
brew "qalculate-gtk"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tailscale"
brew "talosctl"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tpm"
brew "typescript"
brew "ugrep"
brew "vale"
brew "wget"
brew "xz"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"

# Homebrew casks
cask "claude"
cask "dolphin"
cask "ghostty"
cask "kitty"
cask "orbstack"
cask "parsec"
cask "pinta"
cask "signal"
cask "visual-studio-code"
cask "zen"
cask "zoom"
