tap "adembc/homebrew-tap"
tap "charmbracelet/tap"
tap "jesseduffield/lazydocker"
tap "th-ch/youtube-music"

# Homebrew packages
brew "act"
brew "antidote"
brew "atuin"
brew "bandwhich"
brew "bat"
brew "binsider"
brew "biome"
brew "bitwarden-cli"
brew "btop"
brew "caddy"
brew "cava"
brew "chezmoi"
brew "coreutils"
brew "ctop"
brew "curl"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "foreman"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glances"
brew "glow"
brew "gnu-units"
brew "gnupg"
brew "gum"
brew "hyperfine"
brew "inetutils"
brew "jj"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazysql"
brew "lazyssh"
brew "lego"
brew "llvm"
brew "overmind"
brew "pixi"
brew "podman"
brew "presenterm"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tailscale"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tpm"
brew "tree"
brew "ugrep"
brew "vale"
brew "wget"
brew "wishlist"
brew "xz"
brew "youtube-music"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
