tap "charmbracelet/tap"
tap "dhth/tap"
tap "jesseduffield/lazydocker"
tap "siderolabs/tap"

# Homebrew packages
brew "adobe-source-code-pro-fonts"
brew "atuin"
brew "bandwhich"
brew "bat"
brew "bc"
brew "binsider"
brew "biome"
brew "bitwarden-cli"
brew "blueman"
brew "bluez"
brew "bluez-utils"
brew "breeze"
brew "brightnessctl"
brew "btop"
brew "caddy"
brew "cava"
brew "chezmoi"
brew "cliphist"
brew "coreutils"
brew "curl"
brew "dart-sass"
brew "direnv"
brew "dive"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "figlet"
brew "figurine"
brew "findutils"
brew "fish"
brew "flatpak"
brew "foreman"
brew "fuse2"
brew "fzf"
brew "gcc"
brew "gdu"
brew "getnf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "gjs"
brew "glances"
brew "glow"
brew "gnome-calculator"
brew "gnome-system-monitor"
brew "gnome-text-editor"
brew "gnu-units"
brew "gnupg"
brew "gobject-introspection"
brew "grim"
brew "grimblast"
brew "gtk-engine-murrine"
brew "gtk3"
brew "gtk4"
brew "htop"
brew "hyperfine"
brew "hypridle"
brew "hyprland"
brew "hyprlock"
brew "hyprpanel"
brew "hyprpaper"
brew "hyprpicker"
brew "hyprshade"
brew "hyprshot"
brew "imagemagick"
brew "imv"
brew "inetutils"
brew "inxi"
brew "jq"
brew "jujutsu"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazysql"
brew "lego"
brew "libadwaita"
brew "libgtop"
brew "libnotify"
brew "libsoup3"
brew "libspng"
brew "llvm"
brew "loupe"
brew "lsd"
brew "matugen"
brew "mercurial"
brew "meson"
brew "mission-center"
brew "mousepad"
brew "mpv"
brew "nano"
brew "nautilus"
brew "neovim"
brew "network-manager-applet"
brew "networkmanager"
brew "niri"
brew "noto-fonts"
brew "noto-fonts-emoji"
brew "npm"
brew "nvtop"
brew "nwg-displays"
brew "otf-font-awesome"
brew "overmind"
brew "pacman-contrib"
brew "pacseek"
brew "pamixer"
brew "pciutils"
brew "pipewire"
brew "pipewire-alsa"
brew "pipewire-audio"
brew "pipewire-pulse"
brew "pixi"
brew "pkg-config"
brew "playerctl"
brew "polkit-gnome"
brew "presenterm"
brew "python"
brew "python-gobject"
brew "python-gpustat"
brew "python-pip"
brew "python-pyquery"
brew "python-pywalfox"
brew "python-requests"
brew "python-screeninfo"
brew "pywal"
brew "qalculate-gtk"
brew "qt5ct"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "sddm"
brew "shellcheck"
brew "shfmt"
brew "slurp"
brew "starship"
brew "swappy"
brew "swaync"
brew "tailscale"
brew "talosctl"
brew "thefuck"
brew "thunar"
brew "tlrc"
brew "tmux"
brew "tpm"
brew "ttf-dejavu"
brew "ttf-fira-code"
brew "ttf-fira-sans"
brew "ttf-jetbrains-mono"
brew "tumbler"
brew "typescript"
brew "ugrep"
brew "unzip"
brew "upower"
brew "uwsm"
brew "vale"
brew "vim"
brew "wallust"
brew "waybar"
brew "waypaper"
brew "wf-recorder"
brew "wget"
brew "whiptail"
brew "wishlist"
brew "wl-clipboard"
brew "wofi"
brew "xarchiver"
brew "xclip"
brew "xdg-utils"
brew "xz"
brew "yad"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zip"
brew "zoxide"
brew "zsh"
brew "zsh-completions"

# Homebrew casks
cask "firefox"
cask "pinta"
