# Homebrew casks
cask "atuin"
cask "bandwhich"
cask "bat"
cask "binsider"
cask "biome"
cask "bitwarden-cli"
cask "bluez"
cask "btop"
cask "caddy"
cask "cava"
cask "chezmoi"
cask "claude"
cask "coreutils"
cask "curl"
cask "direnv"
cask "dive"
cask "duf"
cask "eza"
cask "fastfetch"
cask "fd"
cask "firefox"
cask "fish"
cask "fzf"
cask "gcc"
cask "gdu"
cask "gh"
cask "ghostty"
cask "git"
cask "git-delta"
cask "git-lfs"
cask "gitleaks"
cask "glances"
cask "glow"
cask "gnu-units"
cask "gnupg"
cask "gobject-introspection"
cask "htop"
cask "hyperfine"
cask "inetutils"
cask "inxi"
cask "jq"
cask "jujutsu"
cask "just"
cask "lazydocker"
cask "lazygit"
cask "lazyjj"
cask "lazysql"
cask "lego"
cask "libnotify"
cask "llvm"
cask "mercurial"
cask "mpv"
cask "neovim"
cask "overmind"
cask "parsec"
cask "pinta"
cask "pixi"
cask "presenterm"
cask "qalculate-gtk"
cask "ripgrep"
cask "shellcheck"
cask "shfmt"
cask "signal"
cask "starship"
cask "tailscale"
cask "talosctl"
cask "thefuck"
cask "tlrc"
cask "tmux"
cask "tpm"
cask "typescript"
cask "ugrep"
cask "vale"
cask "visual-studio-code"
cask "wget"
cask "wishlist"
cask "xz"
cask "yazi"
cask "yt-dlp"
cask "zellij"
cask "zen"
cask "zoom"
cask "zoxide"
cask "zsh"
